---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.ClipPlane.Dispose
source: html/32703f7a-2a76-129c-d2e0-e69395ff1767.htm
---
# Autodesk.Revit.DB.DirectContext3D.ClipPlane.Dispose Method

Releases all resources used by the ClipPlane

## Syntax (C#)
```csharp
public void Dispose()
```